ETL/DataProcessors/ЗаданияНаВыгрузкуОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЗаданияНаВыгрузкуОтчетов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ETL/InformationRegisters/ЗаданияНаВыгрузкуОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияНаВыгрузкуОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеОчищать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/DataProcessors/ЗаданияНаВыгрузкуОтчетов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(ТипОтчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНач = НачалоГода(ТекущаяДата());
	Иначе
		ДатаНач = ДатаНачала;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаКон = КонецГода(ТекущаяДата());
	Иначе
		ДатаКон = ДатаОкончания;
	КонецЕсли;
	
	Если Базы.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Базы.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Базы КАК Базы
		               |ГДЕ
		               |	НЕ Базы.ПометкаУдаления";
		Выборка = Запрос.Выполнить().Выбрать();
		
		СписокБаз = Новый Массив;
		Пока Выборка.Следующий() Цикл
			СписокБаз.Добавить(Выборка.Ссылка);
		КонецЦикла;
	Иначе
		СписокБаз = Базы.ВыгрузитьЗначения();
	КонецЕсли;	
	
	Для Каждого База Из СписокБаз Цикл
		Менеджер = РегистрыСведений.ЗаданияНаВыгрузкуОтчетов.СоздатьМенеджерЗаписи();
		Менеджер.БазаДанных = База;
		Менеджер.ТипОтчета = ТипОтчета;
		Менеджер.Счет = Счет;
		Менеджер.ДатаНачала = ДатаНач;
		Менеджер.ДатаОкончания = ДатаКон;
		Менеджер.НеОчищать = НеОчищать;
		Менеджер.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры
